app/controllers/games_controller.rb

  def index
    games = Game.all
---
SELECT "games".* FROM "games"

  def create
    set_game
    # if @game
    #   @game.save
    # else
      @game = Game.create(game_params)
---
INSERT INTO "games" ("state", "created_at", "updated_at") VALUES (?, ?, ?)  [["state", "---\n- ''\n- ''\n- X\n- ''\n- ''\n- ''\n- ''\n- ''\n- ''\n"], ["created_at", "2018-10-19 16:29:02.584626"], ["updated_at", "2018-10-19 16:29:02.584626"]]

  def set_game
    @game = Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", nil]]